In [1]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai", "delhi", "bamglore"],
    "temperature": [32, 45, 30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  bamglore           30        78

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temperature": [21, 14, 35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
df = pd.concat([india_weather, us_weather], ignore_index = True) #combine datas
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  bamglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [7]:
df = pd.concat([india_weather, us_weather], keys=["india", "us"]) #combine datas
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  bamglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [8]:
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [15]:
temperature_df = pd.DataFrame({
     "city": ["mumbai", "delhi", "bamglore"],
    "temperature": [32, 45, 30]
}, index=[0,1,2])

temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  bamglore           30

In [20]:
windspeed_df = pd.DataFrame({
     "city": ["mumbai", "delhi"],
    "windspeed": [7,12]
}, index=[1,0])
windspeed_df

     city  windspeed
1  mumbai          7
0   delhi         12

In [23]:
df = pd.concat([temperature_df, windspeed_df.windspeed], axis = 1) #inserts dataframe as column, axis = 0 inserts to row
df

       city  temperature  windspeed
0    mumbai           32       12.0
1     delhi           45        7.0
2  bamglore           30        NaN

In [24]:
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [25]:
df = pd.concat([temperature_df, s], axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  bamglore           30   Rain